---
kind: type
id: T:Autodesk.Revit.DB.Visual.SurfaceNdfType
source: html/4f4b4727-20bc-b161-ade5-b750a7e9c8f4.htm
---
# Autodesk.Revit.DB.Visual.SurfaceNdfType

The enumerated type representing the permitted values for the asset property "SurfaceNdfType" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public enum SurfaceNdfType
```